In [1]:
print("Welcome")

Welcome

## How to create a pandas dataframe from scratch

In [7]:
import pandas as pd

In [9]:
df = pd.DataFrame({'name': [ 'Juan', 'Dave', 'Daisy', 'Anne', 'Kev', 'Halima'],
                   'Age': [ 18, 19, 21, 26, 24, 20],
                   'City': ['Miami', 'Alabama', 'Chiccago', 'Houston', 'Santiago', 'Buenos Aires'],
                   'GPA' : [3.2, 3.4, 4.0, 3.5, 4.0, 2.7]
                  })

In [11]:
df

     name  Age          City  GPA
0    Juan   18         Miami  3.2
1    Dave   19       Alabama  3.4
2   Daisy   21      Chiccago  4.0
3    Anne   26       Houston  3.5
4     Kev   24      Santiago  4.0
5  Halima   20  Buenos Aires  2.7

## Defining functions. In Detail

In [13]:
# Simple def functions
def add(a,b):
    """Adds the provided numbers"""
    return a+b
add(4,5)

9

In [15]:
# Calling the argument
result = add(1,2)
result

3

### Arbitrary Arguments (*args)

In [17]:
def multiply(*args):
    result = 1
    for num in args:
        result*=num
    return result
multiply(2,1,3,1)

6

As we can see above, args allow you the freedom to insert as many values as possible

### Multiple keyword arguments as a dictionary

In [19]:
def names(**kwargs):
    for key, value in kwargs.items():
        print (f"{key} is {value} years old")
names(Kev=12 , Jane= 13, Jude=14, Ann =11)

Kev is 12 years old
Jane is 13 years old
Jude is 14 years old
Ann is 11 years old

In [21]:

def city(**kwargs):
    for key, value in kwargs.items():
        print (f"{key} is the capital of {value}")
city(Nairobi = "Kenya" , Kampala = "Uganda", Dodoma = "Tanzania")

Nairobi is the capital of Kenya
Kampala is the capital of Uganda
Dodoma is the capital of Tanzania

### Lambda Functions

In [23]:
square  = lambda x : x*x
square(4)

16

In [25]:
square(12)

144

In [27]:
age = list(df['Age'])

In [29]:
age_squared = list(map(lambda x: x**2,age ))
age_squared

[324, 361, 441, 676, 576, 400]

In [31]:
root = 64**0.5
root

8.0

In [33]:
max_val = lambda a, b: a if a > b else b
print(max_val(10, 15))

15

In [35]:
def greeting(x):
    for name in x:
        print(f" Hello {name}, Welcome!")

In [37]:
greeting(df['name'])

 Hello Juan, Welcome!
 Hello Dave, Welcome!
 Hello Daisy, Welcome!
 Hello Anne, Welcome!
 Hello Kev, Welcome!
 Hello Halima, Welcome!

In [39]:
df

     name  Age          City  GPA
0    Juan   18         Miami  3.2
1    Dave   19       Alabama  3.4
2   Daisy   21      Chiccago  4.0
3    Anne   26       Houston  3.5
4     Kev   24      Santiago  4.0
5  Halima   20  Buenos Aires  2.7

In [41]:
def meet(name):
    message = f"Hi {name.capitalize()}"
    return message
meet("Joe")

'Hi Joe'

In [43]:
import sqlite3

In [73]:
connection = sqlite3.connect("songs.db")

In [75]:
cursor = connection.cursor()

In [79]:
cursor.execute("Create table songs( release_yr integer, Artist text , Song text)")

In [81]:
release = [
    (2016, "Juice World" , "All girls are the same"),
    (2018, "21 Savage" , "Runnin"),
    (2019, "XXX-Tentancion" , "Hope"),
    (2023, "Dave" , "Sprinter"),
    (2020, "Snoop-Dogg" , "Star"),
    (2021, "SZA", "Kill Bill"),
    (2022, "Doja" , "Woman")
]

In [85]:
cursor.executemany("Insert into songs values (?,?,?)", release)

In [87]:
for row in cursor.execute("select * from songs"):
    print(row)

(2016, 'Juice World', 'All girls are the same')
(2018, '21 Savage', 'Runnin')
(2019, 'XXX-Tentancion', 'Hope')
(2023, 'Dave', 'Sprinter')
(2020, 'Snoop-Dogg', 'Star')
(2021, 'SZA', 'Kill Bill')
(2022, 'Doja', 'Woman')

In [ ]:
cursor.execute("select * from songs

In [ ]:
connection.close()